#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.iam.azurerm_role_assignment.admins["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"] will be created
  + resource "azurerm_role_assignment" "admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.azurerm_role_assignment.admins["32544b2f-b97d-4453-9555-1ad71630512c"] will be created
  + resource "azurerm_role_assignment" "admins" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Administrator"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-wallet-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.azurerm_role_assignment.cdn_contributors["0f0aa158-b7ad-4cac-af02-82c3e4768ee6"] will be created
  + resource "azurerm_role_assignment" "cdn_contributors" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0f0aa158-b7ad-4cac-af02-82c3e4768ee6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.iam.azurerm_role_assignment.cdn_contributors["32544b2f-b97d-4453-9555-1ad71630512c"] will be created
  + resource "azurerm_role_assignment" "cdn_contributors" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "32544b2f-b97d-4453-9555-1ad71630512c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Owner"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletcdnst01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.function_apps.module.function_app_user.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Web/sites/io-p-itn-wallet-user-func-01"
        name                                           = "io-p-itn-wallet-user-func-01"
      ~ storage_account_name                           = "iopitnwalletuserst01" -> "iopitnwalletuserstfn01"
        tags                                           = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (26 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.function_apps.module.function_app_user.azurerm_private_endpoint.st_blob must be replaced
-/+ resource "azurerm_private_endpoint" "st_blob" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-blob-pep-01" -> (known after apply)
        name                     = "io-p-itn-wallet-user-blob-pep-01"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-wallet-user-blob-pep-01.nic.ebbbd943-1c01-49bf-bc71-572936175bdc"
              - name = "io-p-itn-wallet-user-blob-pep-01.nic.ebbbd943-1c01-49bf-bc71-572936175bdc"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-blob-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.blob.core.windows.net"
              - name                = "privatelink.blob.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "iopitnwalletuserst01.privatelink.blob.core.windows.net"
                      - ip_addresses = [
                          - "10.20.2.10",
                        ]
                      - name         = "iopitnwalletuserst01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-blob-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "io-p-itn-wallet-user-blob-pep-01"
          ~ private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletuserst01" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.20.2.10" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.function_apps.module.function_app_user.azurerm_private_endpoint.st_file must be replaced
-/+ resource "azurerm_private_endpoint" "st_file" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-file-pep-01" -> (known after apply)
        name                     = "io-p-itn-wallet-user-file-pep-01"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-wallet-user-file-pep-01.nic.6b9f00d3-1df2-43c7-8a66-971de205526c"
              - name = "io-p-itn-wallet-user-file-pep-01.nic.6b9f00d3-1df2-43c7-8a66-971de205526c"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-file-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.file.core.windows.net"
              - name                = "privatelink.file.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.file.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "iopitnwalletuserst01.privatelink.file.core.windows.net"
                      - ip_addresses = [
                          - "10.20.2.8",
                        ]
                      - name         = "iopitnwalletuserst01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-file-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "io-p-itn-wallet-user-file-pep-01"
          ~ private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletuserst01" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.20.2.8" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.function_apps.module.function_app_user.azurerm_private_endpoint.st_queue must be replaced
-/+ resource "azurerm_private_endpoint" "st_queue" {
      ~ custom_dns_configs       = [] -> (known after apply)
      ~ id                       = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-queue-pep-01" -> (known after apply)
        name                     = "io-p-itn-wallet-user-queue-pep-01"
      ~ network_interface        = [
          - {
              - id   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/networkInterfaces/io-p-itn-wallet-user-queue-pep-01.nic.afc9991e-f804-4033-8cb3-5fa6a7a3c438"
              - name = "io-p-itn-wallet-user-queue-pep-01.nic.afc9991e-f804-4033-8cb3-5fa6a7a3c438"
            },
        ] -> (known after apply)
      ~ private_dns_zone_configs = [
          - {
              - id                  = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-queue-pep-01/privateDnsZoneGroups/private-dns-zone-group/privateDnsZoneConfigs/privatelink.queue.core.windows.net"
              - name                = "privatelink.queue.core.windows.net"
              - private_dns_zone_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-common/providers/Microsoft.Network/privateDnsZones/privatelink.queue.core.windows.net"
              - record_sets         = [
                  - {
                      - fqdn         = "iopitnwalletuserst01.privatelink.queue.core.windows.net"
                      - ip_addresses = [
                          - "10.20.2.9",
                        ]
                      - name         = "iopitnwalletuserst01"
                      - ttl          = 10
                      - type         = "A"
                    },
                ]
            },
        ] -> (known after apply)
        tags                     = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (3 unchanged attributes hidden)

      ~ private_dns_zone_group {
          ~ id                   = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Network/privateEndpoints/io-p-itn-wallet-user-queue-pep-01/privateDnsZoneGroups/private-dns-zone-group" -> (known after apply)
            name                 = "private-dns-zone-group"
            # (1 unchanged attribute hidden)
        }

      ~ private_service_connection {
            name                           = "io-p-itn-wallet-user-queue-pep-01"
          ~ private_connection_resource_id = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletuserst01" # forces replacement -> (known after apply) # forces replacement
          ~ private_ip_address             = "10.20.2.9" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.function_apps.module.function_app_user.azurerm_role_assignment.function_storage_account_contributor must be replaced
-/+ resource "azurerm_role_assignment" "function_storage_account_contributor" {
      ~ id                               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletuserst01/providers/Microsoft.Authorization/roleAssignments/3abe06c0-1672-e4d2-faf8-4602b9ab0ce5" -> (known after apply)
      ~ name                             = "3abe06c0-1672-e4d2-faf8-4602b9ab0ce5" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/17d1049b-9a84-46fb-8f53-869881c3d3ab" -> (known after apply)
      ~ scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletuserst01" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.function_apps.module.function_app_user.azurerm_role_assignment.function_storage_blob_data_owner must be replaced
-/+ resource "azurerm_role_assignment" "function_storage_blob_data_owner" {
      ~ id                               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletuserst01/providers/Microsoft.Authorization/roleAssignments/6029a4b8-4b67-437c-1264-becf763c3196" -> (known after apply)
      ~ name                             = "6029a4b8-4b67-437c-1264-becf763c3196" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/b7e6dc6d-f1e8-4753-8033-0f276bb0955b" -> (known after apply)
      ~ scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletuserst01" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.function_apps.module.function_app_user.azurerm_role_assignment.function_storage_queue_data_contributor must be replaced
-/+ resource "azurerm_role_assignment" "function_storage_queue_data_contributor" {
      ~ id                               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletuserst01/providers/Microsoft.Authorization/roleAssignments/843f7bcd-2eb1-0ee3-1cad-0ef5ade25e5d" -> (known after apply)
      ~ name                             = "843f7bcd-2eb1-0ee3-1cad-0ef5ade25e5d" -> (known after apply)
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/providers/Microsoft.Authorization/roleDefinitions/974c5e8b-45b9-4653-ba55-5f855dd0fb88" -> (known after apply)
      ~ scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletuserst01" # forces replacement -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.function_apps.module.function_app_user.azurerm_storage_account.this must be replaced
-/+ resource "azurerm_storage_account" "this" {
      ~ access_tier                        = "Hot" -> (known after apply)
      ~ id                                 = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletuserst01" -> (known after apply)
      + large_file_share_enabled           = (known after apply)
      ~ name                               = "iopitnwalletuserst01" -> "iopitnwalletuserstfn01" # forces replacement
      ~ primary_access_key                 = (sensitive value)
      ~ primary_blob_connection_string     = (sensitive value)
      ~ primary_blob_endpoint              = "https://iopitnwalletuserst01.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                  = "iopitnwalletuserst01.blob.core.windows.net" -> (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      ~ primary_connection_string          = (sensitive value)
      ~ primary_dfs_endpoint               = "https://iopitnwalletuserst01.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                   = "iopitnwalletuserst01.dfs.core.windows.net" -> (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      ~ primary_file_endpoint              = "https://iopitnwalletuserst01.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                  = "iopitnwalletuserst01.file.core.windows.net" -> (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      ~ primary_location                   = "italynorth" -> (known after apply)
      ~ primary_queue_endpoint             = "https://iopitnwalletuserst01.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                 = "iopitnwalletuserst01.queue.core.windows.net" -> (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      ~ primary_table_endpoint             = "https://iopitnwalletuserst01.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                 = "iopitnwalletuserst01.table.core.windows.net" -> (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      ~ primary_web_endpoint               = "https://iopitnwalletuserst01.z38.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                   = "iopitnwalletuserst01.z38.web.core.windows.net" -> (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      ~ secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      ~ secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
        tags                               = {
            "CostCenter"     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Wallet"
            "Owner"          = "IO"
            "Source"         = "https://github.com/pagopa/io-wallet/blob/main/infra/resources/prod"
        }
        # (20 unchanged attributes hidden)

      - blob_properties {
          - change_feed_enabled           = false -> null
          - change_feed_retention_in_days = 0 -> null
          - last_access_time_enabled      = false -> null
          - versioning_enabled            = false -> null
        }

      - network_rules {
          - bypass                     = [
              - "AzureServices",
              - "Logging",
              - "Metrics",
            ] -> null
          - default_action             = "Deny" -> null
          - ip_rules                   = [] -> null
          - virtual_network_subnet_ids = [] -> null
        }

      - queue_properties {
          - hour_metrics {
              - enabled               = true -> null
              - include_apis          = true -> null
              - retention_policy_days = 7 -> null
              - version               = "1.0" -> null
            }
          - logging {
              - delete                = false -> null
              - read                  = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
              - write                 = false -> null
            }
          - minute_metrics {
              - enabled               = false -> null
              - include_apis          = false -> null
              - retention_policy_days = 0 -> null
              - version               = "1.0" -> null
            }
        }

      - share_properties {
          - retention_policy {
              - days = 7 -> null
            }
        }
    }

  # module.function_apps.module.function_app_user.azurerm_storage_account_network_rules.st_network_rules must be replaced
-/+ resource "azurerm_storage_account_network_rules" "st_network_rules" {
      ~ id                         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletuserst01" -> (known after apply)
      ~ ip_rules                   = [] -> (known after apply)
      ~ storage_account_id         = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-wallet-rg-01/providers/Microsoft.Storage/storageAccounts/iopitnwalletuserst01" # forces replacement -> (known after apply) # forces replacement
      ~ virtual_network_subnet_ids = [] -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.function_apps.module.function_app_user.azurerm_subnet.this will be updated in-place
  ~ resource "azurerm_subnet" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-common-rg-01/providers/Microsoft.Network/virtualNetworks/io-p-itn-common-vnet-01/subnets/io-p-itn-wallet-user-func-snet-01"
        name                                           = "io-p-itn-wallet-user-func-snet-01"
      ~ service_endpoints                              = [
          + "Microsoft.Web",
        ]
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 12 to add, 2 to change, 8 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
